import { useState } from "react";
import Header from "../../components/Header/Header"
import Styled from "./RulesPage.module.css"
const RulePage = () => {
    const [isExpanded, setIsExpanded] = useState(false);
    const [isExpanded2, setIsExpanded2] = useState(false);
    const [isExpanded3, setIsExpanded3] = useState(false);
    const [isExpanded4, setIsExpanded4] = useState(false);
    const [isExpanded5, setIsExpanded5] = useState(false);
    const [isExpanded6, setIsExpanded6] = useState(false);
    const [isExpanded7, setIsExpanded7] = useState(false);
    const [isExpanded8, setIsExpanded8] = useState(false);
    const [isExpanded9, setIsExpanded9] = useState(false);
    const [isExpanded10, setIsExpanded10] = useState(false);








    const toggleExpansion = () => {
        setIsExpanded(!isExpanded);
    };
    const toggleExpansion2 = () => {
        setIsExpanded2(!isExpanded2);
    };
    const toggleExpansion3 = () => {
        setIsExpanded3(!isExpanded3);
    };
    const toggleExpansion4 = () => {
        setIsExpanded4(!isExpanded4);
    };
    const toggleExpansion5 = () => {
        setIsExpanded5(!isExpanded5);
    };
    const toggleExpansion6 = () => {
        setIsExpanded6(!isExpanded6);
    };
    const toggleExpansion7 = () => {
        setIsExpanded7(!isExpanded7);
    };
    const toggleExpansion8 = () => {
        setIsExpanded8(!isExpanded8);
    };
    const toggleExpansion9 = () => {
        setIsExpanded9(!isExpanded9);
    };
    const toggleExpansion10 = () => {
        setIsExpanded10(!isExpanded10);
    };
    return (


        // در این صفحــه می‌خوانیــد:
        // مقررات سفرهای گروهی دلتا
        // شرایط حضور پت در سفرها
        // قوانین سفرهای گروهی دلتا
        // شرایــط کنسلی
        // روال ثبت‌نام در سفــرها
        // سفــرهای لَغـــوی

        <>
            <Header />
            <div className={Styled.Imagebox}>
                <img src="image/Untitled-2.jpg" alt="" />
                <span>قوانین و مقررات</span>
            </div>
            <div className={Styled.TableBox}>

                <div className={Styled.Table}>

                    <div className={Styled.TitleTable}>
                        در این صفحــه می‌خوانیــد:
                    </div>
                    <a href="#s1">

                        <div className={Styled.TableLine}>
                            مقررات سفرهای گروهی دلتا
                        </div>
                    </a>
                    <a href="#s2">

                        <div className={Styled.TableLine}>
                            شرایط حضور پت در سفرها
                        </div>
                    </a>
                    <a href="#s3">

                        <div className={Styled.TableLine}>
                            قوانین سفرهای گروهی بتا
                        </div>
                    </a>
                    <a href="#s4">

                        <div className={Styled.TableLine}>
                            روال ثبت‌نام در سفــرها
                        </div>
                    </a>
                    <a href="#s5">

                        <div className={Styled.TableLine}>
                         شرایط کنسلی
                        </div>
                    </a>
                    <a href="#s6">

                        <div className={Styled.TableLine}>
                            سفــرهای لَغـــوی
                        </div>
                    </a>
                </div>
            </div>
            <div className={Styled.TitleBox}>
                <div id="s1"> مقررات سفرهای گروهی بتا</div>
            </div>
            <div className={Styled.TitleBox}>
                <span>  قوانین مربوط به خودرو</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>

                    ۱- به دلیل حفظ امنیت و سلامتی مسافران، هرگونه رفتارهای هیجانی و نامتعارف مانند بیرون آمدن از سانروف، نشستن بر لبه پنجره، باربند، ایستادن روی رکاب و امثالهم در طول حرکت ممنوع است.

                    ۲- تمام اتومبیل‌ها ملزم به همراه داشتن لوازم فنی (زاپاس مناسب، جک، آچار چرخ و...) و مواردی هستند که قبل از هر تور توسط گروه اعلام می‌گردد. لذا در صورت نیاز به امداد، هر اتومبیل می‌بایست از تجهیزات شخصی خود استفاده کند. این لوازم در ابتدای سفر توسط کادر اجرایی دلتا بررسی و در صورت همراه نداشتن تجهیزات، امکان همراهی در سفر وجود نخواهد داشت.

                    ۳- تمامی اتومبیل‌ها با فاصله معین و در رد چرخ اتومبیل جلویی و پشت سر اتومبیل مارشال (لیدر) حرکت کرده و از هرگونه حرکات اضافی در مسیر جدا پرهیز کنند. همچنین در صورت ارائه چیدمان و ترتیب حرکت اتومبیل‌ها توسط لیدر به آن پایبند باشند. لطفاً از سبقت گرفتن از همدیگر و رانندگی پر خطر در جاده‌ها و بیراهه‌ها خودداری فرمایید.

                    ۴- با توجه به قرار داشتن تجهیزات ارتباطی در تمام اتومبیل‌ها لطفاً از شوخی‌های نامناسب و مکالمات غیر ضروری پشت بیسیم جدا خودداری فرمایید.

                    ۵- توجه داشته باشید، با توجه به احتمال بروز خرابی/حادثه و... برای هر کدام از مسافرین در سفرهای آفرودی،آمادگی، صبوری و کار گروهی از ملزومات شرکت در سفرهای بیراهه‌نوردی است.

                    6- هر کدام از مسافران با آگاهی از چالش‌های احتمالی سفرهای آفرودی در برنامه‌ها شرکت می‌کند. بنابراین مسئولیت بروز هرگونه اتفاق/حادثه برای همسفران یا خودروی ایشان برعهده خودشان بوده و بتا مسئولیتی در این زمینه نخواهد داشت. گفتنی است که تمام تلاش تیم فنی و اجرایی بتا در طول سفر، سفری بی‌خطر و مساعدت به همسفران بر رفع معایب احتمالی خواهد بود.

                    7- از کامل بودن مدارک خودرو شامل بیمه‌نامه معتبر، معاینه فنی، کم‌تر بودن میزان خلافی خودرو از حد مجاز، نداشتن شکایت روی خودرو و... اطمینان حاصل فرمایید.

                    8-مسافرین بدون خودرو که با خودروی گروه سفر می‌کنند، در صورت درخواست واحدهای انتظامی برای بازدید از خودرو، ملزم هستند شخصاً وسایل و کوله خود را تخلیه نمایند و در صورت همراه داشتن هر وسیله غیر متعارف، مسئولیت پاسخگویی به عهده خود فرد می‌باشد.
                </div>
                {!isExpanded && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion}>
                    {isExpanded ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span>قوانین زیست محیطی</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded2 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>
                    ۱- به دلیل احترام به بافت محلی لطفاً در عبور از جوامع محلی و برخورد با ساکنین آن‌جا، حجاب و پوشش مناسب خود را رعایت کرده و صدای موسیقی اتومبیل‌ها را کم کرده و از رانندگی پرخطر جدا خودداری فرمایید.
                    <br />
                    <br />
                    ۲- اساس طبیعت‌گردی مسئـــولانه بر احترام و تلاش برای حفظ و حراست حداکـثری از محیط زیست می‌باشد. این مهم با همـــکاری همه امکان‌پذیر است؛ رهاکردن هرگونه زباله شامل زباله‌های غیرقابل بازیافت (مانند ته‌سیگار، ظروف یک‌بار مصرف، پلاستیک، شیشه و...) زباله‌های زیست تخریب پذیر (مانند پوست میوه، پوست تخمه، پسماند غذا) در طبیعت و مسیر اکیداً ممنوع است.گفتنی است که مسئولیت جمع آوری، نگهداری و حمل زباله هر خودرو به عهده هر مسافر می‌باشد.
                    <br />
                    <br />
                    ۳- ورود خارج از برنامه به عرصه‌های طبیعی شامل مراتع، رودخانه‌ها و... ممنوع می‌باشد. اصول سافاری گروه بتا  بر مبنای طبیعت گردی مسئولانه است.
                    <br />
                    <br />
                    ۴-. یادمان باشد ما در طبیعت مهمان هستیم. و طبیعت بستر زندگی گونه‌های مختلف حشرات، حیوانات و گیاهان است. بنابراین آمادگی مواجهه با آن‌ها و خطرات احتمالی را داشته باشیم.
                    <br />
                    <br />
                    ۵-پیش بینی وضع هوا مربوط به نزدیک‌ترین ایستگاه هواشناسی و الگوهای ماهواره‌ای است. با توجه به حضور ما در طبیعت و غیرقابل پیش‌بینی بودن وضع هوا، امکان بروز خطا و اشتباه محتمل می‌باشد. فلذا هر فرد و خودرو می‌بایست آمادگی لازم را در مواجهه با شرایط غیرقابل پیش‌بینی داشته باشد.
                </div>
                {!isExpanded2 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion2}>
                    {isExpanded2 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span>قوانین عمومی</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded3 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>

                    1- گروه طبیعت‌گردی بتا بر پایه قوانین جمهوری اسلامی ایران فعالیت می‌کند و پایبندی به تمام قوانین برای کلیه همسفران بتا الزامی می‌باشد.

                    مسئولیت هر گونه تخطی از قوانین جاری و ساری کشور به عهده شخص بوده و بتا هیچ گونه مسئولیتی در این مورد ندارد.
                    <br />
                    <br />
                    ۲- به دلیل حفظ شأن و محیط خانوادگی تورها، لطفاً در نوع پوشش خود دقت فرمایید و از پوشیدن لباس‌های خارج از عرف برای خانم‌ها و آقایان جدا خودداری فرمایید.
                    <br />
                    <br />
                    ۳-استعمال هر گونه مواد مخدر، محرک و امثالهم، در تمام مدت برگزاری تور ممنوع است و گروه بتا در هر زمان از سفر مجاز به اخراج و برخورد قانونی با فرد خاطی و کنسل نمودن تور (بدون بازگشت هزینه) می‌باشد. همچنین به‌جهت لزوم هوشیاری کامل در طول سفر و جلوگیری از عواقب ناشی از آن، خوردن هرگونه نوشیدنی الکلی برای مسافرین بتا ممنوع می‌باشد.
                    <br />
                    <br />
                    ۴-انجام هرگونه حرکات خطر آفرین در طول مدت سفر ممنوع می‌باشد.
                    <br />
                    <br />
                    ۵-مسئولیت مراقبت از هر خانواده برعهده سرپرست خانواده است. همچنین مراقبت کامل از فرزندان در طول زمان سفر برعهده والدین آن‌هاست.
                    <br />
                    <br />
                    ۶-ثبت نام در سفر به‌منزله پذیرش کلیه قوانین و مقررات گروه بتا برای خود و سایر همسفرانتان می‌باشد.

                </div>
                {!isExpanded3 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion3}>
                    {isExpanded3 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span>زمان بنــدی</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded4 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>

                    ۱-به دلیل احترام به دیگر همسفران لطفاً در موعد مقرر در محل حاضر شوید و زمان خود را مطابق با برنامه‌های زمانی اعلام شده مدیریت کنید. بدیهی است مسئولیت جاماندن از سفر به دلیل تأخیر در حضور به‌موقع، برعهده خود شخص بوده و وقت‌شناسی همسفران به اجرای برنامه طبق زبان‌بندی کمک خواهد کرد.
                    <br />
                    <br />
                    ۲-در طول برنامه و در فواصل مشخص، گروه برای استراحت، عکاسی، پر کردن سوخت و... توقف می‌کند، خواهشمند است به هیچ‌وجه خارج از برنامه‌ی گروه در طول مسیر توقف نفرمایید.
                    <br />
                    <br />
                    ۳-در صورت بروز شرایط فورس ماژور مانند حادثه برای خودروها یا همسفران یا امثالهم، لیدر می‌تواند تمام یا بخشی از برنامه‌های اعلام شده را تغییر و یا کنسل کند.

                </div>
                {!isExpanded4 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion4}>
                    {isExpanded4 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span id="s3">قوانین سفرهای گروهی بتا</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded5 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>
                    •	لطفا قبل از سفر از معتبر بودن و تاریخ داشتن مدارک خودرو و عدم داشتن خلافی و شکایتی روی خودرو مطمئن شوید.
                    <br />
                    <br />
                    •	 همه‌ی همسفران در سفرهای بتا باید شأن خانوادگی بودن گروه را حفظ کرده و به آن پایبند باشند.
                    (متاسفانه امکان میزبانی آقایان مجردی که برای اولین بار قصد سفر با گروه را دارند وجود ندارد.)
                    <br />
                    <br />

                    •	 در صورتی که تجربه کمپینگ ندارید حتما قبل از سفر مسئول ثبت نام رو مطلع کنید و برای تجربه اول سفر با سختی بالاتر از ۴ از ۵ را (که در آگهی سفر ذکر می‌شود) انتخاب نکنید.
                    <br />
                    <br />

                    •	 در هنگام اقامت در هتل‌ها و اقامتگاه‌ها همسفران تابع قوانین محل اقامت می‌باشند. (لطفا مدارک مورد نیاز را همراه داشته باشید)
                    <br />
                    <br />

                    •	 اقامتگاه‌های بومگردی مکانی برای آشنایی و تعامل با فرهنگ/غذا و سبک زندگی روستایی است که توسط افراد محلی اداره می‌شود،مسلما اگر استراحت در هتل برایتان خوشایند بوده انتخاب سفرهایی که اقامت در بومگردی‌ها را دارند مناسب نیست. (همچنین خیلی از مقاصد ما در ایران فاقد هتل‌های خوب و استاندارد می‌باشد)
                    <br />
                    <br />

                    •	 ساعت بیدار باش صبح و ساعت خاموشی شب توسط لیدر اعلام می‌گردد؛ اگرصبح زودتر بیدار شدید یا شب دیرتر خوابیدید لطفا حتما سکوت کمپ را رعایت کنید!
                    <br />
                    <br />


                    •	 تمام تلاش لیدر و تیم اجرای بتا برای برگزاری بهتر سفر برای همه‌ی همسفران می‌‍‌باشد،لطفا به زمان استراحت آن‌ها احترام بگذارید.
                    <br />
                    <br />

                    •	 اگر به ماده‌ی غذایی خاصی حساسیت دارید قبل از سفر نوع وعده‌های غذایی را از لیدر سفر ب‍پرسید؛ در صورتی که وعده‌ها برای شما حساسیت‌زاست غذای مورد نیاز خود را همراه بیاورید.
                    <br />
                    <br />

                    •	 لطفا از آوردن باند و رقص نور و... که با ذات طبیعت‌گردی سازگار نیست و باعث سلب آرامش و آسایش گروه و طبیعت می‌شود جدا خودداری فرمایید.
                    <br />
                    <br />

                    •	 در صورت مبتلا بودن به بیماری یا حساسیت خاصی قبل از سفر مسئول ثبت‌نام و هنگام سفر لیدر گروه را از آن و محل نگهداری دارو ها،علائم بیماری / حساسیت و اقدامات اضطراری مطلع کنید.
                    <br />
                    <br />

                    •	لطفا هنگام سفر و کمپینگ حتما در شب موقع استراحت تمام لوازم‌ خود را جمع کرده و در خودرو یا چادر خود بگذارید.
                    <br />
                    <br />

                    •	 به دلیل اینکه سفرهای ما غالبا به مناطق بکر طبیعی است لطفا جهت حفظ و حراست از این میراث گرانبها کوشا باشیم؛ مراقب رفتار فرزندانمان در مواجهه با طبیعت باشیم.
                    <br />
                    <br />

                    •	 لطفا موقع رفتن به دستشویی حتما طبق قاعده‌ی طبیعت گردی رفتار کنیم. (کندن چاله / پر کردن آن و آوردن دستمال های کاغذی با خود و...)
                    <br />
                    <br />

                    •	 هنگام ترک کمپ با دقت دور خودرو یا چادر خود را بررسی کنید که زباله‌ای جا نمانده باشد.
                    <br />
                    <br />

                    •	 عکس‌ها یا تصاویری که توسط عکاس یا تصویر‌بردار گروه گرفته می شود پس از بازبینی نهایی در گروه سفر قرار می‌گیرد. لطفا اگر تمایل ندارید از شما عکس گرفته شود و در تصاویر استفاده شود موضوع را به لیدر یا عکاس گروه اعلام بفرمایید.
                    <br />
                    <br />

                    •	 در فرهنگ ما عکس/فیلم گرفتن از خانم‌ها بدون اطلاع و کسب اجازه از آنها رفتار پسندیده‌ای نیست؛ همچنین حتما در جوامع روستایی و محلی و شهرها قبل از عکاسی از افراد از آنها کسب اجازه کنید.
                    <br />
                    <br />

                    •	 بتا این حق را برای خود قائل است از تصاویر به اشتراک گذاشته شده در گروه با رعایت اصول حرفه‌ی استفاده کند. (بدیهی است امکان استفاده از تصویر دوستانی که پوشش و حجاب مناسب ندارند در فضای مجازی قابل استفاده نیست)
                    از اینکه با رعایت قوانین و مقررات سفرهای گروهی بتا ما را در اجرای بهتر برنامه یاری می‌کنید. صمیمانه سپاسگزاریم.
                </div>
                {!isExpanded5 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion5}>
                    {isExpanded5 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span>قوانین سفرهای کویریِ بتا:</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded6 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>
                    •	لطفا در هنگام انتخاب سفر به باشگاه سفر و درجه آفرودِ آن دقت فرمایید. (در "باشگاه سفر و خانواده" کویر نوردی ساده‌تر و "باشگاه ادونچر" سفرِ پرچالش‌تر و سنگین‌تری برگزار می شود)
                    <br />
                    <br />

                    •	سرویس پذیرایی و وعده‌های غذایی سفر در اکثر سفرهای ادونچر (پایه) می‌باشد.
                    <br />
                    <br />
                    •	حضور در سفرهای با درجه آفرود" 5+"ملزم به تایید فنی تیم برگزار کننده سفر می‌باشد.
                    <br />
                    <br />
                    •	همراه داشتن تجهیزاتِ ابتدایی کویر‌نوردی شامل میل پرچم - تجهیزات ارتباطی مناسب – تسمه بکسل – شِگِل – پمپ و درجه باد، در تمامی سفرهای کویری الزامیست.
                    <br />
                    <br />
                    •	برای سفرهای ادونچر علاوه بر لیست اولیه‌ی تجهیزات، لوازم یدکی خودرو و تجیهزات تخصصی‌تر بنا بر اعلام لیدرِ برنامه الزامیست.
                    <br />
                    <br />
                    •	داشتن مهارت و تجربه کویرنوردی به شما کمک می‌کند سفر بهتری را تجربه کنید. اما فراموش نکنیم که لازمه‌ی یک سفرِ حرفه‌ای و خاطره‌انگیز، داشتنِ اخلاق حرفه‌ای، روحیه کار تیمی و صبوری است.
                    <br />
                    <br />
                    •	حادثه، خرابی، گیرکردن و حوادثی از این دست، بخش جدایی‌ناپذیر سفرهای آفرودی‌ست و این اتفاق ممکن است برای همه‌ی ما پیش بیاید. در صورت رخ دادن این اتفاق لیدر سفر بهترین تصمیم را بر مبنای مصلحت گروه خواهد گرفت.
                    <br />
                    <br />
                    •	پیش‌نیاز: در هر سفری پیش‌نیاز سفر(تعداد تجربه سفر های کویر ذکر می‌شود)
                    <br />
                    <br />
                    •	پیش نیاز سفرهای ادونچر حضور در بیش از 10 سفر کویری باشگاه سفر و خانواده و نیازمند تایید تیم فنی بتاست.
                    <br />
                    <br />
                    •	قبل از تمام سفرها از سلامت فنی خودرو – همراه داشتن تجهیزات ابتدایی مانند جک و آچار چرخ و همچنین اطمینان از سلامت و به روز بودن تاریخ لاستیک زاپاس خودرو الزامی است.
                    <br />
                    <br />
                    •	در سفرهای بتا رفتارها و گفتارهای به اصطلاح «کَل‌کَل» ممنوع است.
                    <br />
                    <br />
                    •	در سفرهای بتا خط چرخ فقط مربوط به خودروی اول است. برای جلوگیری از بروز حادثه و اتفاق برای خود و هم تیمی‌ها انجام هرگونه حرکات نمایشی اضافه مانند عرضی زدن یا تیغه عوض کردن، درگ و امثالهم در تور ممنوع
                    است.
                    <br />
                    <br />
                    •	سفرهای باشگاه سفر و خانواده، سافاری سبک‌تری نسبت به سفرهای ادونچر دارد. مهم است شما جه سفری را انتخاب میکنید.

                </div>
                {!isExpanded6 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion6}>
                    {isExpanded6 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span id="s4">روال ثبت‌نام سفــرها</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded7 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>
                    ۱- مطالعه قوانین و مقررات سـفر
                    <br />
                    <br />
                    ۲- ارسال کامل اطلاعات درخواستی بتا از خود و همراهان
                    <br />
                    <br />
                    ۳- واریز وجه و ارسال رسید

                    الف) مطالعه قوانین سفرها برای مسافران جدید و همه همراهان الزامیست و اقدام به ثبت‌نام مسافران به منزله‌ی تایید و تعهد به رعایت این مقررات است.

                    ب) جهت عدم بروز بی نظمی و مشکل در فرآیند ثبت‌نام، لطفا همه مسافران (اعم از جدید و قدیمی) فقط و فقط از طریق پشتیبانی بتا elta4wd و یا تماس با شماره‌های زیر اقدام به ثبت‌نام خود و همراهان خود نمایند.
                    ۰۹۱۲۹۴۹۲۸۹۶

                    ج) لطفا توجه فرمایید که اطلاعات درخواستی خود و همراهان را نهایتا تا ۲۴ ساعت بصورت کامل ارسال فرمایید؛ در غیر این صورت حتی با وجود واریزی، ثبت‌نام شما در حالت معلق بوده و مسافرانِ با اطلاعات کامل در اولویت ثبت‌نام خواهند بود.
                </div>
                {!isExpanded7 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion7}>
                    {isExpanded7 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span id="s2">شرایط حضور پت</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded8 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>

                    حتما قبل از آوردن حیوانات لیدر برنامه را مطلع کنید.
                    <br />
                    <br />
                    •	در تمام هتل‌ها و بیشتر اقامتگاه‌ها به دلیلی قوانین امکان همراه داشتن سگ ممنوع و باقی حیوانات با باکس و قفس مخصوص امکان‌پذیر است.
                    <br />
                    <br />
                    •	مسئولیت نگهداری از حیوانات به طور کامل به عهده‌ی صاحب آن می‌باشد.
                    <br />
                    <br />
                    •	حتما از سلامت حیوان خود مطمئن باشید و تجربه بیرون آوردن در طبیعت را داشته باشید (بعضی حیوانات در محیط‌های بیرونی دچار استرس یا ترس و... می‌شوند)
                    <br />
                    <br />
                    •	از آوردن سگ با جثه و نژاد‌های غیر متعارف به عنوان پت در تور جدا خودداری کنید.
                    <br />
                    <br />
                    •	تمام حیوانات (سگ و گربه) در طول سفر باید دارای قلاده باشند.
                    <br />
                    <br />
                    •	از آوردن و همراه داشتن حیوانات وحشی که حمل و نگهداری آنها غیر قانونی است جدا خودداری فرمایید.
                    <br />
                    <br />
                    •	در مواقع حضور سگ‌های گله  یا سگ‌های دیگر، مراقب سگ‌های خود باشید.
                    <br />
                    <br />
                    •	از همراه داشتن حیواناتی که سر و صدای زیادی دارند و باعث اختلال در آسایش دیگر همسفران می‌شوند خودداری فرمایید.
                    <br />
                    <br />
                    •	حیوانات خود را در بیرون از خودرو در محیط‌های شهری و روستایی ترجیحا با باکس مخصوص حمل کنید.
                    <br />
                    <br />
                    •	از گرداندن حیوانات اهلی خود (علی الخصوص سگ) در محیط‌های روستایی به دلیل بافت مذهبی و محلی روستا خودداری کنید.
                    <br />
                    <br />
                    •	در جریان باشید به دلیل ترس یا فوبیای احتمالی همسفران از حیوان شما باید حداکثر تأمل با دیگر همسفران را داشته باشید.
                </div>
                {!isExpanded8 && <div className={Styled.fade}></div>}

            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion8}>
                    {isExpanded8 ? 'بستن' : 'ادامه'}
                </button>
            </div>
            <div className={Styled.TitleBox}>
                <span id="s5">شرایــط کنسلی</span>
            </div>
            <div className={`${Styled.textContainer} ${isExpanded9 ? Styled.expanded : ''}`}>

                <div className={Styled.textContent}>
                    ۱-از لحظه ثبت‌نام به دلیل برنامه‌ریزی، تهیه مواد غذایی و رزرو اقامتگاه‌ها/ هتل‌ها و... امکان کنسلی تا:
                    <br />
                     10 روز قبل از سفر با کسر ۱۰ درصد هزینه
                    <br />

                    5 روز قبل از سفر با کسر ۵۰ درصد هزینه
                    <br />

 72 ساعت قبل سفر با کسر ۷۰ درصد هزینه
                    <br />
                    و کمتر از 72 ساعت با کسر کل مبلغ پرداختی امکان پذیر است.
                    <br />
                    لازم به ذکر است بعد از تکمیل ظرفیت سفر حتی در صورتی که چند روز تا زمان سفر باقی مانده باشد، به دلیل بسته شدن ثبت‌نام، در صورت کنسلی، هزینه کامل کسر خواهد شد.
                    <br />
                    تبصره: سفرهایی که در آنها مراکز اقامتی و یا از حمل و نقل عمومی (هواپیما، قطار و...) استفاده می‌گردد در صورت کنسلی و یا جابجایی مطابق قوانین کنسلی آنها عمل خواهد شد.
                    <br />
                    ۲- امکان جابجایی اسامی نفرات تا 72 ساعت قبل از سفر با هماهنگی امکان پذیر است. (جز در سفرهایی که بلیط / مجوز به نام فرد صادر شده است)
                    <br />
                    ۳- پس از تاریخ اعلام شده برای ثبت‌نام یا تکمیل ثبت‌نام امکان اضافه شدن هیچ یک از عزیزان نخواهد بود. برای جلوگیری از تضییع حقوق سایرین، این شرایط برای همه یکسان می‌باشد.
                    <br />
                    4. سیستم رزرو در سفرها بتا  وجود ندارد و فقط واریز وجه کامل و ارائهٔ اطلاعات کامل در زمان مقرر به منزله‌ی ثبت نام قطعی سفر می‌باشد.
                    <br />
                                   </div>
                {!isExpanded9 && <div className={Styled.fade}></div>}
                
            </div>
            <div>

            </div>
            <div className={Styled.buttonBox}>
                <button className={Styled.readMoreBtn} onClick={toggleExpansion9}>
                    {isExpanded9 ? 'بستن' : 'ادامه'}
                </button>
            </div>
                <div className={Styled.TitleBox}>
                    <span id="s6">سفرهای لَغــوی</span>
                </div>
                <div className={`${Styled.textContainer} ${isExpanded10 ? Styled.expanded : ''}`}>

                    <div className={Styled.textContent}>

                        به دلیل عدم امکان پیش‌بینی دقیق آب و هوا یا شرایط فورس ماژور، امکان لغو سفرها در راستای این شرایط از طرف مجموعه بتا وجود دارد. در صورت لغو سفر از طرف این مجموعه، اطلاعیه لغو سفر اعلام، و مبلغ پرداختی مسافران بصورت کامل ظرف حداکثر 48 ساعت به حساب آن‌ها عودت داده خواهد شد.

                    </div>
                    {!isExpanded10 && <div className={Styled.fade}></div>}

                </div>
                <div>

                </div>
                <div className={Styled.buttonBox}>
                    <button className={Styled.readMoreBtn} onClick={toggleExpansion10}>
                        {isExpanded10 ? 'بستن' : 'ادامه'}
                    </button>
                </div>
        </>
    )

}

export default RulePage