// import { useState } from "react";
// import Header from "../../components/Header/Header"
// import Styled from "./RulesPage.module.css"
// const RulePage = () => {
//     // const [isExpanded, setIsExpanded] = useState(false);

//     // const toggleExpansion = () => {
//     //     setIsExpanded(!isExpanded);
//     // };

//     return (
//         // <>
//         //     <Header />
//         //     {/* <div className={Styled.Imagebox}>
//         //         <img src="image/Untitled-2.jpg" alt="" />
//         //         <span>قوانین و مقررات</span>
//         //     </div>
//         //     <div className={Styled.TitleBox}>
//         //         <span>مقررات سفرهای گروهی بتا</span>
//         //     </div>
//         //     <div className={`${Styled.textContainer} ${isExpanded ? Styled.expanded : ''}`}>
//         //         <div>  قوانین مربوط به خودرو</div>
//         //         <div className={Styled.textContent}>

//         //             ۱- به دلیل حفظ امنیت و سلامتی مسافران، هرگونه رفتارهای هیجانی و نامتعارف مانند بیرون آمدن از سانروف، نشستن بر لبه پنجره، باربند، ایستادن روی رکاب و امثالهم در طول حرکت ممنوع است.

//         //             ۲- تمام اتومبیل‌ها ملزم به همراه داشتن لوازم فنی (زاپاس مناسب، جک، آچار چرخ و...) و مواردی هستند که قبل از هر تور توسط گروه اعلام می‌گردد. لذا در صورت نیاز به امداد، هر اتومبیل می‌بایست از تجهیزات شخصی خود استفاده کند. این لوازم در ابتدای سفر توسط کادر اجرایی دلتا بررسی و در صورت همراه نداشتن تجهیزات، امکان همراهی در سفر وجود نخواهد داشت.

//         //             ۳- تمامی اتومبیل‌ها با فاصله معین و در رد چرخ اتومبیل جلویی و پشت سر اتومبیل مارشال (لیدر) حرکت کرده و از هرگونه حرکات اضافی در مسیر جدا پرهیز کنند. همچنین در صورت ارائه چیدمان و ترتیب حرکت اتومبیل‌ها توسط لیدر به آن پایبند باشند. لطفاً از سبقت گرفتن از همدیگر و رانندگی پر خطر در جاده‌ها و بیراهه‌ها خودداری فرمایید.

//         //             ۴- با توجه به قرار داشتن تجهیزات ارتباطی در تمام اتومبیل‌ها لطفاً از شوخی‌های نامناسب و مکالمات غیر ضروری پشت بیسیم جدا خودداری فرمایید.

//         //             ۵- توجه داشته باشید، با توجه به احتمال بروز خرابی/حادثه و... برای هر کدام از مسافرین در سفرهای آفرودی،آمادگی، صبوری و کار گروهی از ملزومات شرکت در سفرهای بیراهه‌نوردی است.

//         //             6- هر کدام از مسافران با آگاهی از چالش‌های احتمالی سفرهای آفرودی در برنامه‌ها شرکت می‌کند. بنابراین مسئولیت بروز هرگونه اتفاق/حادثه برای همسفران یا خودروی ایشان برعهده خودشان بوده و بتا مسئولیتی در این زمینه نخواهد داشت. گفتنی است که تمام تلاش تیم فنی و اجرایی بتا در طول سفر، سفری بی‌خطر و مساعدت به همسفران بر رفع معایب احتمالی خواهد بود.

//         //             7- از کامل بودن مدارک خودرو شامل بیمه‌نامه معتبر، معاینه فنی، کم‌تر بودن میزان خلافی خودرو از حد مجاز، نداشتن شکایت روی خودرو و... اطمینان حاصل فرمایید.

//         //             8-مسافرین بدون خودرو که با خودروی گروه سفر می‌کنند، در صورت درخواست واحدهای انتظامی برای بازدید از خودرو، ملزم هستند شخصاً وسایل و کوله خود را تخلیه نمایند و در صورت همراه داشتن هر وسیله غیر متعارف، مسئولیت پاسخگویی به عهده خود فرد می‌باشد.
//         //         </div>
//         //         {!isExpanded && <div className={Styled.fade}></div>}

//         //     </div>
//         //     <div>

//         //     </div>
//         //     <button className={Styled.readMoreBtn} onClick={toggleExpansion}>
//         //         {isExpanded ? 'بستن' : 'ادامه'}
//         //     </button> */}
//         // </>  
//     )      

// }
      
// export default RulePage