import Styled from "./AbouteUs.module.css"
import Header from "./../../components/Header/Header"
const AbouteUs = () => {
    return (
        <>
            <Header />
            <div className={Styled.AboutUsPage}>
                <div className={Styled.ImageBox}>
                <img src="image/a.jpg" alt="" />
                    <span>درباره ما</span>
                </div>
                <div className={Styled.TitleBox}>
                    <h2>داستان بتا</h2>
                </div>
                <div className={Styled.Box}>
                    <p>داســتان بتا
                        سال ۱۳۹۳ نخستین سفر بتا را برگزار کردیم. پس از آن بود که تلاش کردیم تا کیفیت، دانش و سفر مسوولانه را چاشنی کار کنیم و بر اساس قواعد اکوتوریسم، همراه و همپای همسفر‌هایمان شویم. به تدریج، خانواده بتا بزرگ شد تا به امروز. امروزی که بتا، فراتر از یک نام، بالاتر از یک تور و بیشتر از یک گروه، به یک «خانواده» تبدیل شد. خانواده‌ای به وسعت خاک ایران و با دغدغه‌ی دیدار از مناطق بکر و ماجراجویی و هیجان در کنار محافظت از منابع طبیعی کشورمان.

                    </p>
                    <img src="image/b.jpg" alt="" />
                </div>
                <div className={Styled.Box}>
                  <p>
                  بتا با اجرای بیش از 265 سفر تا کنون، برگزار کننده با کیفیـــــت‌ترین سفـــــرهای عمـــــــــومی و خصــــــوصی طبیعـــت‌گردی با مقاصد بکر، جذاب و دیدنی در اقصــــی نقاط ایــران می‌باشــــد.
 
 
                  </p>
                    <img src="image/JZ2A7053.JPG" alt="" />
                </div>
                <div className={Styled.Box}>
                   <p>
                   ویژگی‌های سفر با بتا
کیفیـــت، امنیـــت، دانـــش سفـــر،گردشـــگری پایـــدار
بتا در تمامی سفرهای خود با رعایت اصول و چهارچوبی خاص جهت رفاه حال همسفران تمامی فاکتورهای لازم اعم از کیفیت و امنیت سفر را تامین نموده، و با دانشی که طی سال‌ها تجربه در سفر به اقصی نقاط ایران کسب کرده، تجربه‌ای بی‌نظیر برای همسفران خود به ارمغان می‌آورد.
همچنین پایبندی به اصول گردشگری پایدار جهت حفظ محیط زیست و طبیعت زیبای سرزمین‌مان ایران از ارزش‌های بنیادین گروه طبیعت‌گردی بتاست.

                   </p>
                    <img src="image/c.jpg" alt="" />
                </div>
            </div>
        </>
    )
}

export default AbouteUs